no_bs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-05-25 Sat 16:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>No BS Guide to Linear Algebra</title>
<meta name="author" content="W" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">No BS Guide to Linear Algebra</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org74e56c4">1. Chapter 1: Math Fundamentals</a>
<ul>
<li><a href="#org3ebd25f">1.1. Completing the square</a></li>
<li><a href="#org5cea595">1.2. Quadratic formula</a></li>
<li><a href="#orgd5f96fc">1.3. Golden ratio</a></li>
<li><a href="#org5287edf">1.4. Solving systems of linear equations</a>
<ul>
<li><a href="#orgd1a7ca2">1.4.1. Geometric solution</a></li>
<li><a href="#org661289a">1.4.2. Set notation</a></li>
<li><a href="#org2d8973f">1.4.3. Conclusion</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4a0e84c">2. Chapter 2: Intro to Linear Algebra</a>
<ul>
<li><a href="#org58d4cdd">2.1. Vector operations</a></li>
<li><a href="#orgaec20da">2.2. Matrix operations</a></li>
<li><a href="#orgd7a41dc">2.3. Matrix-vector product</a>
<ul>
<li><a href="#org98816b8">2.3.1. Dual interpretation of matrix-vector product</a></li>
<li><a href="#orgc0758e9">2.3.2. Linear combinations as matrix products</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org74e56c4" class="outline-2">
<h2 id="org74e56c4"><span class="section-number-2">1.</span> Chapter 1: Math Fundamentals</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org3ebd25f" class="outline-3">
<h3 id="org3ebd25f"><span class="section-number-3">1.1.</span> Completing the square</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Rewrite any quadratic expression \(x^2 + BX + C\) as perfect square + some correction factor, i.e. \((x+p)^2 + k\).</li>
<li>Becomes: \(x^2 + Bx + C = (x+\frac{B}{2})^2 + C - (\frac{B}{2})^2\)</li>
</ul>
</div>
</div>
<div id="outline-container-org5cea595" class="outline-3">
<h3 id="org5cea595"><span class="section-number-3">1.2.</span> Quadratic formula</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>\(x = \frac{-b\pm \sqrt{b^2-4ac}}{2a}\)</li>
<li>Discriminant: \(b^2-4ac\)</li>
</ul>
</div>
</div>
<div id="outline-container-orgd5f96fc" class="outline-3">
<h3 id="orgd5f96fc"><span class="section-number-3">1.3.</span> Golden ratio</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>\(x^2-x-1=0\)</li>
<li>\(x_1 = (1+\sqrt(5))/2 = \phi\)</li>
<li>\(x_2 = (1-\sqrt(5))/2 = -1/\phi\)</li>
</ul>
</div>
</div>
<div id="outline-container-org5287edf" class="outline-3">
<h3 id="org5287edf"><span class="section-number-3">1.4.</span> Solving systems of linear equations</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>Examples
<ul class="org-ul">
<li>\(n=1\) : \(2x+4=7x\)</li>
<li>\(n=2\) : \(x+2y=5\) \(3x+9y=21\)</li>
</ul></li>
<li>Principles: with \(n\) equations and \(n\) unknowns, the equations can be solved simultaneously:
<ol class="org-ol">
<li>By substitution, i.e. isolate \(x\) in eq1 to obtain \(x=5-2y\), then substitute \(x\) into eq2:
\(3(5-2y) + 9y = 21\), then expand to \(15-6y+9y=21; 3y=6; y=2\)</li>
<li>By subtraction, i.e. multiply eq1 by 3 to obtain: \(3x+6y=15 \& 3x+9y=21\), then gets \(3y=6\) as the \(3x\) terms cancel.</li>
<li>By equating, i.e. isolate \(x\) in both eq1 and eq2, then equate them. \(x=5-2y; x=\frac{1}{3}(21-9y) = 7-3y\)</li>
</ol></li>
</ul>
<p>
More advanced techniques will be covered in chapter 3.
</p>
</div>
<div id="outline-container-orgd1a7ca2" class="outline-4">
<h4 id="orgd1a7ca2"><span class="section-number-4">1.4.1.</span> Geometric solution</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Solving system of 2 linear equations in 2 unknowns is equivalent geometrically to finding the point of intersection between 2 lines in the Cartesian plane.
\(ax+by=c\) with unknown \(x, y\) is actually a <b>constraint</b> equation on the set of possible values for \(x, y\).
Visualize this by considering the coordinate pairs \((x,y)\) that lie in the Cartesian plane.
Cartesian plane as a whole corresponds to the set \(\mathbb{R}^2\) which describes all possible pairs of coordinates.
</p>

<p>
More precisely:
\[
l : \{(x,y) \in \mathbb{R}^2 | ax+by=c\}
\]
</p>

<p>
i.e.: line \(l\) is defined as the subset of pairs of real numbers \((x,y)\) that satisfy equation \(ax+by=c\).
</p>

<p>
Hence, the geometric approach is to:
</p>
<ol class="org-ol">
<li>draw the lines that correspond to each of the equations</li>
<li>Find the coordinates of the point where both lines intersect</li>
</ol>
</div>
</div>
<div id="outline-container-org661289a" class="outline-4">
<h4 id="org661289a"><span class="section-number-4">1.4.2.</span> Set notation</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
And its use in defining possible cases when solving system of 2 linear equations in 2 unknowns
</p>
</div>
<ol class="org-ol">
<li><a id="orgf466c88"></a>One solution<br />
<div class="outline-text-5" id="text-1-4-2-1">
<p>
Lines \(l_1\) and \(l_2\) are non-parallel and intersect at a point.
\[
\{(x,y \in \mathbb{R}^2 | x + 2y=2)\} \cap \{(x,y) \in \mathbb{R}^2 | x=1\} = \{(1, \frac{1}{2})\}
\]
</p>
</div>
</li>
<li><a id="orgbca9ce7"></a>No solution<br />
<div class="outline-text-5" id="text-1-4-2-2">
<p>
Lines \(l_1\) and \(l_2\) are parallel and never intersect.
\[
\{(x,y \in \mathbb{R}^2 | x + 2y=2)\} \cap \{(x,y) \in \mathbb{R}^2 | x+2y=4\} = \emptyset
\]
</p>
</div>
</li>
<li><a id="orgc44c5ee"></a>Infinitely many solutions<br />
<div class="outline-text-5" id="text-1-4-2-3">
<p>
If the lines \(l_1\) and \(l_2\) are parallel and overlapping.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org2d8973f" class="outline-4">
<h4 id="org2d8973f"><span class="section-number-4">1.4.3.</span> Conclusion</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
The solution set can be a point, the empty set or a line.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org4a0e84c" class="outline-2">
<h2 id="org4a0e84c"><span class="section-number-2">2.</span> Chapter 2: Intro to Linear Algebra</h2>
<div class="outline-text-2" id="text-2">
<p>
Definitions and basic operations
</p>
</div>
<div id="outline-container-org58d4cdd" class="outline-3">
<h3 id="org58d4cdd"><span class="section-number-3">2.1.</span> Vector operations</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Addition \(+\)</li>
<li>Subtraction \(-\)</li>
<li>Scaling (implicit)</li>
<li>Dot product (\(\cdot\))</li>
<li>Cross product (\(\times\))</li>
</ol>
</div>
</div>
<div id="outline-container-orgaec20da" class="outline-3">
<h3 id="orgaec20da"><span class="section-number-3">2.2.</span> Matrix operations</h3>
<div class="outline-text-3" id="text-2-2">
<ol class="org-ol">
<li>Addition (\(A + B\))</li>
<li>Subtraction (\(A-B\))</li>
<li>Scaling by a constant \(\alpha\) (\(\alpha A\))</li>
<li>Matrix product (\(AB\))</li>
<li>Matrix-vector product (\(A \vec{v}\))</li>
<li>Matrix inverse (\(A^{-1}\))</li>
<li>Trace \(Tr(A)\)</li>
<li>Determinant (\(det(A)\))</li>
</ol>
</div>
</div>
<div id="outline-container-orgd7a41dc" class="outline-3">
<h3 id="orgd7a41dc"><span class="section-number-3">2.3.</span> Matrix-vector product</h3>
<div class="outline-text-3" id="text-2-3">
<p>
For matrix \(A \in \mathbb{R}^{m\times n}\) and the vector \(\vec{v}\in \mathbb{R}^n\).
</p>

<p>
Matrix-vector product \(A \vec{x}\) produces a linear combination of the columns of matrix \(A\) with coefficients \(\vec{x}\).
</p>

<p>
E.g.: \(\vec{y} = A \vec{x}\)
</p>
</div>

<div id="outline-container-org98816b8" class="outline-4">
<h4 id="org98816b8"><span class="section-number-4">2.3.1.</span> Dual interpretation of matrix-vector product</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>Row picture: single vector with all operations in them. Compute the dot product of the vector with each of the rows of matrix \(A\)</li>
<li>Column picture: multiply each cell of the vector with each column of the matrix. <span class="underline">i.e.</span>, \(\vec{y}\) is a linear combination of the columns of \(A\).</li>
</ul>
</div>
</div>

<div id="outline-container-orgc0758e9" class="outline-4">
<h4 id="orgc0758e9"><span class="section-number-4">2.3.2.</span> Linear combinations as matrix products</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: W</p>
<p class="date">Created: 2024-05-25 Sat 16:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
